# pandas 入门

In [2]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np
import pandas_datareader.data as web

In [2]:
obj = Series([4,7,-5,3])

In [3]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [4]:
obj.values

array([ 4,  7, -5,  3])

In [5]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
obj = Series([4,7,-5,3],index=['a','b','c','d'])

In [7]:
obj

a    4
b    7
c   -5
d    3
dtype: int64

In [9]:
obj[['b','a','c']]

b    7
a    4
c   -5
dtype: int64

In [10]:
obj['b'] = 10
obj

a     4
b    10
c    -5
d     3
dtype: int64

In [11]:
obj[['b','a','c']] = 7
obj

a    7
b    7
c    7
d    3
dtype: int64

In [12]:
7 in obj

False

# heading 2

In [13]:
sdata = {'Ohio': 35000, 'Texas':71000, 'Oregon':16000, 'Utah':5000}
obj3 = Series(sdata)

In [14]:
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [15]:
obj4 = Series(sdata, index=['California','Ohio','Oregon','Texas'])

In [16]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [18]:
data = {'state':['Ohio','Ohio','Ohio','Nevada','Nevada'],
       'year':[2000,2001,2002,2001,2002],
       'pop':[1.5,1.7,3.6,2.4,2.9]}
frame = DataFrame(data)

In [19]:
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [20]:
frame.year

0    2000
1    2001
2    2002
3    2001
4    2002
Name: year, dtype: int64

In [23]:
frame[['state']]

    state
0    Ohio
1    Ohio
2    Ohio
3  Nevada
4  Nevada

In [22]:
frame[['state','year']]

    state  year
0    Ohio  2000
1    Ohio  2001
2    Ohio  2002
3  Nevada  2001
4  Nevada  2002

In [24]:
type(frame.year)

pandas.core.series.Series

In [27]:
type(frame.loc[0])

pandas.core.series.Series

In [28]:
frame.loc[0]

pop       1.5
state    Ohio
year     2000
Name: 0, dtype: object

In [29]:
frame.iloc[[0,1,2],:]

   pop state  year
0  1.5  Ohio  2000
1  1.7  Ohio  2001
2  3.6  Ohio  2002

In [31]:
frame.loc[[0,1,2],:]

   pop state  year
0  1.5  Ohio  2000
1  1.7  Ohio  2001
2  3.6  Ohio  2002

In [32]:
frame.loc[[0,1,2]]

   pop state  year
0  1.5  Ohio  2000
1  1.7  Ohio  2001
2  3.6  Ohio  2002

In [35]:
frame['pop'] = [1,2,2,3,4]

In [36]:
frame

   pop   state  year
0    1    Ohio  2000
1    2    Ohio  2001
2    2    Ohio  2002
3    3  Nevada  2001
4    4  Nevada  2002

In [37]:
frame.pop == frame['pop']

0    True
1    True
2    True
3    True
4    True
Name: pop, dtype: bool

In [38]:
type(frame.pop)

list

In [39]:
type(frame['pop'])

pandas.core.series.Series

In [40]:
frame.columns

Index([u'pop', u'state', u'year'], dtype='object')

In [41]:
pop = {'Nevada':{2001:2.4, 2002:2.9},
      'Ohio':{2000:1.5,2001:1.7,2002:3.6}}
frame2 = DataFrame(pop)

In [42]:
frame2

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [43]:
frame2['Ohio'][:-1]

2000    1.5
2001    1.7
Name: Ohio, dtype: float64

In [44]:
pdata = {'Ohio':frame2['Ohio'][:-1],'Nevada':frame2['Nevada'][:2]}
frame3 = DataFrame(pdata)

In [45]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

In [2]:
obj = Series(range(3), index=['a','b','c'])
index = obj.index

In [3]:
index

Index([u'a', u'b', u'c'], dtype='object')

In [5]:
index = pd.Index(np.arange(3))
obj2 = Series([1.5,-2.5,0],index=index)

In [6]:
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [7]:
obj3 = Series(['blue','purple','yellow'], index=[0,2,4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [8]:
obj3.reindex(range(6))

0      blue
1       NaN
2    purple
3       NaN
4    yellow
5       NaN
dtype: object

In [9]:
obj = Series([1,2,3,4], index=['1','2','3','d'])

In [10]:
obj

1    1
2    2
3    3
d    4
dtype: int64

In [11]:
obj2 = obj.reindex(['a','b','c','d','e'], fill_value=0)

In [12]:
obj2

a    0
b    0
c    0
d    4
e    0
dtype: int64

In [13]:
obj = Series([1,2,3,4], index=['1','2','3','4'])

In [14]:
obj2 = obj.reindex(['a','b','c','d','e'], fill_value=0)
obj2

a    0
b    0
c    0
d    0
e    0
dtype: int64

In [15]:
frame = DataFrame(np.arange(9).reshape((3,3)), index=['a','c','d'], columns=['Ohio','Texas','California'])

In [16]:
states = ['Texas','Utah','California']

In [17]:
frame2 = frame.reindex(columns=states)

In [18]:
frame2

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [19]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [21]:
frame.reindex(['a','b','c','d'])

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [22]:
frame.reindex(['a','b','c','d'],method='ffill')

   Ohio  Texas  California
a     0      1           2
b     0      1           2
c     3      4           5
d     6      7           8

In [23]:
frame.reindex(index=['a','b','c','d'], method='ffill')

   Ohio  Texas  California
a     0      1           2
b     0      1           2
c     3      4           5
d     6      7           8

In [36]:
frame2 = frame.reindex(index=['a','b','c','d'],method='ffill',columns=states.sort())

In [37]:
frame2

   Ohio  Texas  California
a     0      1           2
b     0      1           2
c     3      4           5
d     6      7           8

In [44]:
frameT = frame.reindex(['a','b','c','d'])
frameT2 = frame.reindex(['a','b','c','d'], copy=True)
print(frameT is frame)
print(frameT2 is frame)

False
False

In [39]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [40]:
frameT

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [41]:
frameT2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [42]:
frameT is frameT2

False

In [43]:
a = 1
b = a
print(a is b)

True

In [45]:
obj = Series(np.arange(5.), index=['a','b','c','d','e'])
new_obj = obj.drop('c')

In [46]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [47]:
data = DataFrame(np.arange(16).reshape((4,4)), index=['Ohio','Colorado','Utah','New York'],
                columns=['one','two','three','four'])
data.drop(['Colorado','Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [48]:
data.drop(['two'], axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [49]:
obj = Series(np.arange(4.), index=['a','b','c','d'])

In [50]:
obj['a':'c']

a    0.0
b    1.0
c    2.0
dtype: float64

In [51]:
obj[0:2]

a    0.0
b    1.0
dtype: float64

In [52]:
obj['d':'c']

Series([], dtype: float64)

In [53]:
obj['b':'c'] = 5

In [54]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [55]:
data = DataFrame(np.arange(16).reshape((4,4)),
                index=['Ohio','Colorado','Utah','New York'],
                columns=['one','two','three','four'])

In [56]:
type(data[['two']])

pandas.core.frame.DataFrame

In [57]:
type(obj[['a']])

pandas.core.series.Series

In [58]:
type(obj['a'])

numpy.float64

In [59]:
type(data[:2])

pandas.core.frame.DataFrame

In [60]:
data[data<5]

          one  two  three  four
Ohio      0.0  1.0    2.0   3.0
Colorado  4.0  NaN    NaN   NaN
Utah      NaN  NaN    NaN   NaN
New York  NaN  NaN    NaN   NaN

In [61]:
data['two']>5

Ohio        False
Colorado    False
Utah         True
New York     True
Name: two, dtype: bool

In [62]:
type(data['two']>5)

pandas.core.series.Series

In [63]:
data[np.array([False,False,True,True])]

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [65]:
data[:1].values

array([[0, 1, 2, 3]])

In [66]:
data.loc[['Ohio']]

      one  two  three  four
Ohio    0    1      2     3

In [68]:
data.loc[:,['two']]

          two
Ohio        1
Colorado    5
Utah        9
New York   13

In [69]:
data.loc[['Ohio'],:]

      one  two  three  four
Ohio    0    1      2     3

In [70]:
data.loc[['Ohio'],['two']]

      two
Ohio    1

In [78]:
type(data.iloc[2])

pandas.core.series.Series

In [82]:
data.loc[:'Utah',:'two']

          one  two
Ohio        0    1
Colorado    4    5
Utah        8    9

In [89]:
data.loc[data.three>5, :]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [93]:
s1 = Series([1,2,3,4], index=['a','c','b','d'])
s2 = Series([11,22,33,44,55], index = ['a','c','e','b','f'])

In [94]:
s1+s2

a    12.0
b    47.0
c    24.0
d     NaN
e     NaN
f     NaN
dtype: float64

In [95]:
s1.add(s2, fill_value=0)

a    12.0
b    47.0
c    24.0
d     4.0
e    33.0
f    55.0
dtype: float64

In [96]:
s1.reindex(s2.index, fill_value=0)

a    1
c    2
e    0
b    3
f    0
dtype: int64

In [97]:
s1.reindex(s2.index)

a    1.0
c    2.0
e    NaN
b    3.0
f    NaN
dtype: float64

In [99]:
arr = np.arange(12.).reshape((3,4))

In [100]:
arr

array([[  0.,   1.,   2.,   3.],
       [  4.,   5.,   6.,   7.],
       [  8.,   9.,  10.,  11.]])

In [101]:
arr[0]

array([ 0.,  1.,  2.,  3.])

In [102]:
arr - arr[0]

array([[ 0.,  0.,  0.,  0.],
       [ 4.,  4.,  4.,  4.],
       [ 8.,  8.,  8.,  8.]])

In [103]:
frame = DataFrame(np.arange(12.).reshape((4,3)), columns=list('bde'),index=['Utah','Ohio','Texas','Oregon'])

In [105]:
series = frame.iloc[0]

In [106]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [107]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [108]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [120]:
series2 = frame['d']
series2

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [121]:
frame.sub(series2, axis=0)

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [114]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [123]:
frame = DataFrame(np.random.randn(4,3), columns=list('bde'), index=['Utah','Ohio','Texas','Oregon'])
frame

               b         d         e
Utah   -0.960102  1.861024 -1.661050
Ohio    1.385836 -0.661379  0.819740
Texas  -0.431794  0.460684 -0.371653
Oregon -0.555917  1.235639 -1.458117

In [124]:
np.abs(frame)

               b         d         e
Utah    0.960102  1.861024  1.661050
Ohio    1.385836  0.661379  0.819740
Texas   0.431794  0.460684  0.371653
Oregon  0.555917  1.235639  1.458117

In [125]:
f = lambda x: x.max()-x.min()

In [126]:
frame.apply(f)

b    2.345938
d    2.522403
e    2.480790
dtype: float64

In [127]:
frame.apply(f, axis=1)

Utah      3.522073
Ohio      2.047215
Texas     0.892478
Oregon    2.693756
dtype: float64

In [129]:
def f(x):
    return Series([x.min(), x.max()], index=['min','max'])
frame.apply(f)

             min       max
Utah   -1.661050  1.861024
Ohio   -0.661379  1.385836
Texas  -0.431794  0.460684
Oregon -1.458117  1.235639

In [131]:
obj = Series(range(4), index=['d','a','b','c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [132]:
frame = DataFrame(np.arange(8).reshape((2,4)), index=['three','one'], columns=['d','a','b','c'])

In [133]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [134]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [136]:
obj = Series([3,4,2,5])
obj.sort_values()

2    2
0    3
1    4
3    5
dtype: int64

In [138]:
frame = DataFrame({'b':[4,7,-3,2],'a':[0,1,0,1]})
frame.sort_values(by='b')

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [139]:
frame.sort_values(by=['b'])

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [140]:
frame = DataFrame(np.arange(8).reshape((2,4)), index=['three','one'],columns=['d','a','b','c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [141]:
frame.sort_values(by=['one'],axis=1, ascending=False)

       c  b  a  d
three  3  2  1  0
one    7  6  5  4

In [142]:
obj = Series([7,-5,7,4,2,0,4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [143]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [144]:
obj.rank(method='max')

0    7.0
1    1.0
2    7.0
3    5.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [145]:
obj = Series(range(5), index=['a','a','b','b','c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [146]:
obj.index.is_unique

False

In [147]:
df = DataFrame([[1,np.nan],[7, -4],[np.nan, np.nan],[0,-1]],index=['a','b','c','d'],columns=['one','two'])

In [148]:
df

   one  two
a  1.0  NaN
b  7.0 -4.0
c  NaN  NaN
d  0.0 -1.0

In [149]:
df.sum()

one    8.0
two   -5.0
dtype: float64

In [151]:
df.sum(axis=1)

a    1.0
b    3.0
c    0.0
d   -1.0
dtype: float64

In [152]:
df.mean(axis=1, skipna=False)

a    NaN
b    1.5
c    NaN
d   -0.5
dtype: float64

In [153]:
df.idxmax()

one    b
two    d
dtype: object

In [155]:
all_data ={}
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']:
    all_data[ticker] = web.DataReader(ticker, 'yahoo')

In [159]:
print all_data.keys()

['GOOG', 'AAPL', 'IBM', 'MSFT']

In [160]:
for value in all_data.values():
    print len(value)

2042
2040
2040
2040

In [203]:
price = {}
for key, values in all_data.items():
    result = values['Adj Close']
    if not result.index.is_unique:
        result = result[~result.index.duplicated(keep='first')] #去重
        print result.index.is_unique
    price[key] = result

True

In [205]:
price = DataFrame(price)

In [202]:
volume = {}
for key, values in all_data.items():
    result = values['Volume']
    if not result.index.is_unique:
        result = result[~result.index.duplicated(keep='first')]
        print result.index.is_unique
    volume[key] = result
volume = DataFrame(volume)

True

In [206]:
returns = price.pct_change()

In [207]:
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2018-02-01  0.002090 -0.001915 -0.007941 -0.007894
2018-02-02 -0.043390 -0.047786 -0.020751 -0.026310
2018-02-05 -0.024984 -0.050454 -0.040873 -0.041185
2018-02-06  0.041792  0.023489  0.018423  0.037841
2018-02-07 -0.000061 -0.000389       NaN -0.009635

In [3]:
obj = Series(['c','a','d','a','a','b','b','c','c'])
uniques = obj.unique()

In [4]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [7]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [8]:
pd.value_counts(obj.values, sort=False)

a    3
c    3
b    2
d    1
dtype: int64

In [9]:
mask = obj.isin(['b','c'])
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [10]:
data = DataFrame({'Qu1':[1,3,4,3,4],'Qu2':[2,3,1,2,3],'Qu3':[1,5,2,4,4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [11]:
result = data.apply(pd.value_counts).fillna(0)

In [12]:
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [14]:
a = np.nan
a == np.nan

False

In [15]:
string_data = Series(['aardvark','artichoke',np.nan,'avocado'])

In [16]:
from numpy import nan as NA
data = Series([1,NA,3.5,NA,7])

In [17]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [18]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [19]:
data = DataFrame([[1,6,3],[1,NA,NA],[NA,NA,NA],[NA,6,3]])
cleaned = data.dropna()

In [20]:
data

     0    1    2
0  1.0  6.0  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.0  3.0

In [21]:
cleaned

     0    1    2
0  1.0  6.0  3.0

In [22]:
data.dropna(how='all')

     0    1    2
0  1.0  6.0  3.0
1  1.0  NaN  NaN
3  NaN  6.0  3.0

In [23]:
data[4] = NA

In [24]:
data

     0    1    2   4
0  1.0  6.0  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.0  3.0 NaN

In [25]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.0  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.0  3.0

In [28]:
df = DataFrame(np.random.randn(7,3))
df.loc[:4,1] = NA
df.loc[:2,2] = NA

In [29]:
df

          0         1         2
0 -0.794112       NaN       NaN
1  0.216233       NaN       NaN
2 -0.113370       NaN       NaN
3  0.130819       NaN  0.630085
4 -1.138025       NaN -0.156831
5 -1.878465 -0.418594  0.402766
6  1.263796  0.731002 -0.829896

In [30]:
df.dropna(thresh=3)

          0         1         2
5 -1.878465 -0.418594  0.402766
6  1.263796  0.731002 -0.829896

In [31]:
df.dropna()

          0         1         2
5 -1.878465 -0.418594  0.402766
6  1.263796  0.731002 -0.829896

In [33]:
df.dropna(thresh=1)

          0         1         2
0 -0.794112       NaN       NaN
1  0.216233       NaN       NaN
2 -0.113370       NaN       NaN
3  0.130819       NaN  0.630085
4 -1.138025       NaN -0.156831
5 -1.878465 -0.418594  0.402766
6  1.263796  0.731002 -0.829896

In [36]:
cleaned = df.dropna(axis=1)

In [37]:
cleaned

          0
0 -0.794112
1  0.216233
2 -0.113370
3  0.130819
4 -1.138025
5 -1.878465
6  1.263796

In [38]:
df.fillna(0)

          0         1         2
0 -0.794112  0.000000  0.000000
1  0.216233  0.000000  0.000000
2 -0.113370  0.000000  0.000000
3  0.130819  0.000000  0.630085
4 -1.138025  0.000000 -0.156831
5 -1.878465 -0.418594  0.402766
6  1.263796  0.731002 -0.829896

In [39]:
df.fillna({1:0.5,3:-1})

          0         1         2
0 -0.794112  0.500000       NaN
1  0.216233  0.500000       NaN
2 -0.113370  0.500000       NaN
3  0.130819  0.500000  0.630085
4 -1.138025  0.500000 -0.156831
5 -1.878465 -0.418594  0.402766
6  1.263796  0.731002 -0.829896

In [41]:
df.fillna({1:0.5,3:-1})

          0         1         2
0 -0.794112  0.500000       NaN
1  0.216233  0.500000       NaN
2 -0.113370  0.500000       NaN
3  0.130819  0.500000  0.630085
4 -1.138025  0.500000 -0.156831
5 -1.878465 -0.418594  0.402766
6  1.263796  0.731002 -0.829896

In [44]:
_ = df.fillna(0, inplace=True)

In [46]:
df

          0         1         2
0 -0.794112  0.000000  0.000000
1  0.216233  0.000000  0.000000
2 -0.113370  0.000000  0.000000
3  0.130819  0.000000  0.630085
4 -1.138025  0.000000 -0.156831
5 -1.878465 -0.418594  0.402766
6  1.263796  0.731002 -0.829896

In [47]:
df = DataFrame(np.random.randn(6,3))
df.loc[2:,1] = NA
df.loc[4:,2] = NA

In [48]:
df

          0         1         2
0  1.859037 -1.210233  0.354480
1 -0.978991  2.129930 -0.447838
2  1.050930       NaN  0.848616
3 -0.147224       NaN  1.398275
4  0.550061       NaN       NaN
5  1.584604       NaN       NaN

In [49]:
df.fillna(method='ffill')

          0         1         2
0  1.859037 -1.210233  0.354480
1 -0.978991  2.129930 -0.447838
2  1.050930  2.129930  0.848616
3 -0.147224  2.129930  1.398275
4  0.550061  2.129930  1.398275
5  1.584604  2.129930  1.398275

In [50]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  1.859037 -1.210233  0.354480
1 -0.978991  2.129930 -0.447838
2  1.050930  2.129930  0.848616
3 -0.147224  2.129930  1.398275
4  0.550061       NaN  1.398275
5  1.584604       NaN  1.398275

In [51]:
data = Series([1,NA,3,NA,7])
data.fillna(data.mean())

0    1.000000
1    3.666667
2    3.000000
3    3.666667
4    7.000000
dtype: float64

In [52]:
df

          0         1         2
0  1.859037 -1.210233  0.354480
1 -0.978991  2.129930 -0.447838
2  1.050930       NaN  0.848616
3 -0.147224       NaN  1.398275
4  0.550061       NaN       NaN
5  1.584604       NaN       NaN

In [61]:
df.fillna({1:df[[1]].mean()})

          0         1         2
0  1.859037 -1.210233  0.354480
1 -0.978991  2.129930 -0.447838
2  1.050930       NaN  0.848616
3 -0.147224       NaN  1.398275
4  0.550061       NaN       NaN
5  1.584604       NaN       NaN

In [62]:
df[1].mean()

0.45984834444857237

In [70]:
df.fillna(method='ffill', axis=1)

          0         1         2
0  1.859037 -1.210233  0.354480
1 -0.978991  2.129930 -0.447838
2  1.050930  1.050930  0.848616
3 -0.147224 -0.147224  1.398275
4  0.550061  0.550061  0.550061
5  1.584604  1.584604  1.584604

In [68]:
df.loc[2]

0    1.050930
1         NaN
2    0.848616
Name: 2, dtype: float64

In [110]:
data = Series(np.random.randn(10), index=[['a','a','a','b','b','b','c','c','d','d'],[1,2,3,1,2,3,1,2,2,3]])
data.index

MultiIndex(levels=[[u'a', u'b', u'c', u'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [111]:
data

a  1    0.809041
   2   -1.941463
   3   -0.606422
b  1    0.453423
   2   -0.145134
   3   -2.212568
c  1   -1.776022
   2    2.412474
d  2   -0.052007
   3    1.069558
dtype: float64

In [112]:
data['b']

1    0.453423
2   -0.145134
3   -2.212568
dtype: float64

In [113]:
data= data.sort_index()

In [114]:
data

a  1    0.809041
   2   -1.941463
   3   -0.606422
b  1    0.453423
   2   -0.145134
   3   -2.212568
c  1   -1.776022
   2    2.412474
d  2   -0.052007
   3    1.069558
dtype: float64

In [115]:
data.loc[['a','b']]

a  1    0.809041
   2   -1.941463
   3   -0.606422
b  1    0.453423
   2   -0.145134
   3   -2.212568
dtype: float64

In [116]:
data[:,2]

a   -1.941463
b   -0.145134
c    2.412474
d   -0.052007
dtype: float64

In [117]:
data.unstack()

          1         2         3
a  0.809041 -1.941463 -0.606422
b  0.453423 -0.145134 -2.212568
c -1.776022  2.412474       NaN
d       NaN -0.052007  1.069558

In [119]:
frame = DataFrame(np.arange(12).reshape((4,3)),
                 index=[['a','a','b','b'],[1,2,1,2]],
                 columns=[['Ohio','Ohio','Colorado'],
                         ['Green','Red','Green']])

In [120]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [121]:
frame.index.names = ['key1','key2']
frame.columns.names=['state','color']

In [122]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [126]:
frame['Ohio','Green']

key1  key2
a     1       0
      2       3
b     1       6
      2       9
Name: (Ohio, Green), dtype: int64

In [124]:
pd.MultiIndex.from_arrays([['Ohio','Ohio','Colorado'],['Green','Red','Green']], names=['state','color'])

MultiIndex(levels=[[u'Colorado', u'Ohio'], [u'Green', u'Red']],
           labels=[[1, 1, 0], [0, 1, 0]],
           names=[u'state', u'color'])

In [128]:
frame.loc['a',1]

state     color
Ohio      Green    0
          Red      1
Colorado  Green    2
Name: (a, 1), dtype: int64

In [137]:
frame.swaplevel('key1','key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [133]:
frame.sortlevel('key2')

/home/parallels/anaconda2/lib/python2.7/site-packages/ipykernel_launcher.py:1: FutureWarning: sortlevel is deprecated, use sort_index(level= ...)
  """Entry point for launching an IPython kernel.

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [136]:
frame.sort_index(level='key1')

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [145]:
frame.sort_index(level=0, axis=1)

state     Colorado  Ohio
color        Green Green Red
key1 key2
a    1           2     0   1
     2           5     3   4
b    1           8     6   7
     2          11     9  10

In [146]:
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [147]:
frame.sum(level='color',axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [148]:
frame = DataFrame({'a':range(7),'b':range(7,0,-1),'c':['one','one','one','two','two','two','two'],'d':[0,1,2,0,1,2,3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [149]:
frame2 = frame.set_index(['c','d'])

In [150]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [151]:
frame.set_index(['c','d'],drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [152]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

In [153]:
ser = Series(np.arange(3.))

In [154]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [155]:
ser[-1]

KeyError: -1

In [156]:
ser2 = Series(np.arange(3.), index=['a','b','c'])
ser2[-1]

2.0

In [157]:
ser.loc[:1]

0    0.0
1    1.0
dtype: float64

In [158]:
ser3 = Series(range(4), index=[-5,1,3,6])

In [177]:
ser3[-5:6]

-5    0
 1    1
 3    2
dtype: int64

In [160]:
frame = DataFrame(np.arange(6).reshape(3,2), index=[2,0,1])

In [161]:
frame.irow(0)

AttributeError: 'DataFrame' object has no attribute 'irow'

In [163]:
ser[:-1]

0    0.0
1    1.0
dtype: float64

In [165]:
ser[:-2]

0    0.0
dtype: float64

In [167]:
ser[:1]

0    0.0
dtype: float64

In [ ]:
pdata = pd.Panel(dict((stk, web.get_data_yahoo(stk,'1/1/2009','6/1/2012'))
                     for stk in ['AAPL','GOOG','MSFT','DELL']))

In [ ]:
pdata